# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-pose NPU s4: s3 + Pose_DWC（7x7 DWConv 头增强，三尺度，替代 Self-Attention）
# 改造点: s3基础(LeakyReLU+三尺度+C2f_Context+SEAM) + Pose_DWC替换Pose

# Parameters
nc: 1 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-pose.yaml' will call yolov8-pose.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head (C2f_Context, SEAM, Pose_DWC, 三尺度)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 10
  - [[-1, 6], 1, Concat, [1]]                       # 11: cat backbone P4
  - [-1, 3, C2f_Context, [512]]                     # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 13
  - [[-1, 4], 1, Concat, [1]]                        # 14: cat backbone P3
  - [-1, 3, C2f_Context, [256]]                      # 15

  - [-1, 1, Conv, [256, 3, 2]]                      # 16
  - [[-1, 12], 1, Concat, [1]]                       # 17: cat head P4
  - [-1, 3, C2f_Context, [512]]                      # 18

  - [-1, 1, Conv, [512, 3, 2]]                      # 19
  - [[-1, 9], 1, Concat, [1]]                        # 20: cat head P5
  - [-1, 3, C2f_Context, [1024]]                     # 21

  # SEAM: 空间注意力抗遮挡
  - [15, 1, SEAM, []]                                # 22: SEAM on P3
  - [18, 1, SEAM, []]                                # 23: SEAM on P4
  - [21, 1, SEAM, []]                                # 24: SEAM on P5

  # Pose_DWC: 7x7 DWConv 头增强（NPU 安全，三尺度）
  - [[22, 23, 24], 1, Pose_DWC, [nc, kpt_shape]]     # 25: Pose_DWC(P3, P4, P5)
